# Inventory
brew "ipmitool"

# Cloud Dependencies
brew "awscli"

# GitHub
brew "gh"

# Kubernetes
brew "kubectl"

# Kubernetes tools
brew "yq"
brew "jq"
brew "helm"
brew "kustomize"
brew "kubeconform"
brew "yamllint"

# Flux
tap "fluxcd/tap"
brew "fluxcd/tap/flux"

# Flux Operator (for local ResourceSet expansion)
tap "controlplaneio-fluxcd/tap"
brew "controlplaneio-fluxcd/tap/flux-operator"

# Cloudflare
tap "cloudflare/cloudflare"
brew "cloudflare/cloudflare/cf-terraforming"

# Task
brew "go-task"

# Node.js (for npx in renovate validation)
brew "node"

# OpenTofu
tap 'tofuutils/tap'
brew 'tgenv'
brew 'tofuenv'
brew "tflint" # Does not officially support OpenTofu https://github.com/terraform-linters/tflint/issues/2194#issuecomment-2558127231
brew "terraform-docs"
brew "hcl2json"

# Talos
brew "talosctl"

# Cilium
brew "cilium-cli"
