# Kubernetes
brew "kubectl"

# Kubernetes tools
brew "yq"
brew "jq"
brew "helm"
brew "kustomize"
brew "kubeconform"

# Flux
tap "fluxcd/tap"
brew "fluxcd/tap/flux"

# Cloudflare
tap "cloudflare/cloudflare"
brew "cloudflare/cloudflare/cf-terraforming"

# Task
brew "go-task"

# OpenTofu
tap 'tofuutils/tap'
brew 'tgenv'
brew 'tofuenv'
brew "tflint" # Does not officially support OpenTofu https://github.com/terraform-linters/tflint/issues/2194#issuecomment-2558127231
brew "terraform-docs"

# Talos
brew "talosctl"

# Cilium
brew "cilium-cli"
